"""Допускаемое напряжение сталей марок 09Г2С, 16ГС до 32мм"""
mat_09G2S_16GS_up_to_32mm = (
    (20, 196),
    (100, 177),
    (150, 171),
    (200, 165),
    (250, 162),
    (300, 151),
    (350, 140),
    (375, 133),
    (400, 122),
    (410, 104),
    (420, 92),
    (430, 86),
    (440, 78),
    (450, 71),
    (460, 64),
    (470, 56),
    (475, 53),
)

"""Допускаемое напряжение сталей марок 09Г2С, 16ГС свыше 32мм"""
mat_09G2S_16GS_over_32mm = (
    (20, 183),
    (100, 160),
    (150, 154),
    (200, 148),
    (250, 145),
    (300, 134),
    (350, 123),
    (375, 116),
    (400, 105),
    (410, 104),
    (420, 92),
    (430, 86),
    (440, 78),
    (450, 71),
    (460, 64),
    (470, 56),
    (475, 53),
)

"""Допускаемое напряжение сталей марки Ст3 до 20мм"""
mat_St3_up_to_20mm = (
    (20, 154),
    (100, 149),
    (150, 145),
    (200, 142),
    (250, 131),
    (300, 115),
    (350, 105),
    (375, 93),
    (400, 85),
    (410, 81),
    (420, 75),
    (425, 71),
)

"""Допускаемое напряжение сталей марки Ст3 сыше 20мм"""
mat_St3_over_20mm = (
    (20, 140),
    (100, 134),
    (150, 131),
    (200, 126),
    (250, 120),
    (300, 108),
    (350, 98),
    (375, 93),
    (400, 85),
    (410, 81),
    (420, 75),
    (425, 71),
)

"""Допускаемое напряжение сталей марки Ст20  20мм"""
mat_St20_up_to_160mm = (
    (20, 147),
    (100, 142),
    (150, 139),
    (200, 136),
    (250, 132),
    (300, 119),
    (350, 106),
    (375, 98),
    (400, 92),
    (410, 86),
    (420, 80),
    (430, 75),
    (440, 67),
    (450, 61),
    (460, 55),
    (470, 49),
    (475, 46),
)

"""Допускаемое напряжение сталей марки 12Х18Н10Т"""
mat_list_12X18H10T = (
    (20, 184),
    (100, 174),
    (150, 168),
    (200, 160),
    (250, 154),
    (300, 148),
    (350, 144),
    (375, 140),
    (400, 137),
    (410, 136),
    (420, 135),
    (430, 134),
    (440, 133),
    (450, 132),
    (460, 131),
    (470, 130),
    (480, 129),
    (490, 128),
    (500, 127),
    (510, 126),
    (520, 125),
    (530, 124),
    (540, 111),
    (550, 111),
    (560, 101),
    (570, 97),
    (580, 81),
    (590, 74),
    (600, 68),
    (610, 62),
    (620, 57),
    (630, 52),
    (640, 48),
    (650, 45),
    (670, 42),
    (680, 38),
    (690, 34),
    (700, 30),
)

"""Допускаемое напряжение сталей марки 08X18H10T"""
mat_list_08X18H10T = (
    (20, 168),
    (100, 156),
    (150, 148),
    (200, 140),
    (250, 132),
    (300, 123),
    (350, 113),
    (375, 108),
    (400, 103),
    (410, 102),
    (420, 101),
    (430, 100.5),
    (440, 100),
    (450, 99),
    (460, 98),
    (470, 97.5),
    (480, 97),
    (490, 96),
    (500, 95),
    (510, 94),
    (520, 79),
    (530, 79),
    (540, 78),
    (550, 76),
    (560, 73),
    (570, 69),
    (580, 65),
    (590, 61),
    (600, 57),
)

mat_list = {
    'Лист 09Г2С, 16ГС до 32 мм': mat_09G2S_16GS_up_to_32mm,
    'Лист 09Г2С, 16ГС свыше 32 мм': mat_09G2S_16GS_over_32mm,
    'Труба 09Г2С': mat_09G2S_16GS_over_32mm,
    'Лист Ст3 до 20мм': mat_St3_up_to_20mm,
    'Лист Ст3 свыше 20мм': mat_St3_over_20mm,
    'Лист сталь 20 до 160мм': mat_St20_up_to_160mm,
    'Лист 12Х18Н10Т': mat_list_12X18H10T,
    'Лист 12X18H12T': mat_list_12X18H10T,
    'Лист 10X17H13M2T': mat_list_12X18H10T,
    'Лист 10X17H13M3T': mat_list_12X18H10T,
    'Лист 08Х18Н10Т': mat_list_08X18H10T,
    'Лист 08X18H12T': mat_list_08X18H10T,
    'Лист 08X17H13M2T': mat_list_08X18H10T,
    'Лист 08X17H15M3T': mat_list_08X18H10T

}


def line_interpolate(min_p, max_p, temp):
    x1 = min_p[0]
    x2 = max_p[0]
    f_x1 = min_p[1]
    f_x2 = max_p[1]
    return f_x1 - ((f_x1 - f_x2) * (temp - x1)) / (x2 - x1)


def find_sigma(t, place):
    min_s = None
    max_s = None

    if t < place[0][0]:
        return place[0][1]
    if t > place[-1][0]:
        return False

    for i, tt in enumerate(place):
        if t == place[i][0]:
            return place[i][1]
        if place[i][0] < t < place[i+1][0]:
            min_s = place[i]
            max_s = place[i+1]
            print(min_s, max_s)
            break

    return line_interpolate(min_s, max_s, t)


def calc_test_pressure(calc_pressure, calc_temp, material):
    sigma_20 = find_sigma(20, material)
    sigma_calc = find_sigma(calc_temp, material)
    return 1.25 * calc_pressure * (sigma_20/sigma_calc)
